common/src/test/resources/xml/invalid-message.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
	<soap-env:Header />
	<soap-env:Body>
		<test xmlns="http://www.example.org/schema">
			<number>not-number</number>
		</test>
	</soap-env:Body>
</soap-env:Envelope>